In [2]:
import pandas as pd

In [3]:
san_francisco = pd.read_excel("C:/Users/Kaden/OneDrive/Projects/Affordability/data/san_francisco_demand_with_education.xlsx")

In [4]:
san_francisco.head()

,Unnamed: 0,Occupation Title,Total Employment,Job Openings in Last Month,Normalized Demand,Typical Education Level
0,713,"Transportation Workers, All Other",130.0,79,1.000000,High School Diploma
1,254,"Artists and Related Workers, All Other",60.0,33,0.905063,High School Diploma
2,341,Hearing Aid Specialists,100.0,33,0.543038,Bachelor's Degree
3,305,Exercise Physiologists,30.0,9,0.493671,Master's Degree
4,327,Magnetic Resonance Imaging Technologists,370.0,111,0.493671,Bachelor's Degree

In [5]:
san_francisco.columns

Index(['Unnamed: 0', 'Occupation Title', 'Total Employment',
       'Job Openings in Last Month', 'Normalized Demand',
       'Typical Education Level'],
      dtype='object')

In [6]:
san_francisco.drop("Unnamed: 0", axis = 1, inplace = True)
san_francisco.head()

,Occupation Title,Total Employment,Job Openings in Last Month,Normalized Demand,Typical Education Level
0,"Transportation Workers, All Other",130.0,79,1.000000,High School Diploma
1,"Artists and Related Workers, All Other",60.0,33,0.905063,High School Diploma
2,Hearing Aid Specialists,100.0,33,0.543038,Bachelor's Degree
3,Exercise Physiologists,30.0,9,0.493671,Master's Degree
4,Magnetic Resonance Imaging Technologists,370.0,111,0.493671,Bachelor's Degree

In [15]:
high_school = san_francisco[san_francisco["Typical Education Level"] == "High School Diploma"]
bachelors = san_francisco[san_francisco["Typical Education Level"] == "Bachelor's Degree"]
graduate = san_francisco[(san_francisco["Typical Education Level"] == "Master's Degree") | (san_francisco["Typical Education Level"] == "Doctorate Degree")]

In [16]:
bachelors.head()

,Occupation Title,Total Employment,Job Openings in Last Month,Normalized Demand,Typical Education Level
2,Hearing Aid Specialists,100.0,33,0.543038,Bachelor's Degree
4,Magnetic Resonance Imaging Technologists,370.0,111,0.493671,Bachelor's Degree
8,"Life Scientists, All Other",120.0,32,0.438819,Bachelor's Degree
10,Medical Dosimetrists,40.0,10,0.411392,Bachelor's Degree
13,"Designers, All Other",460.0,93,0.332691,Bachelor's Degree

In [17]:
bachelors.reset_index(inplace = True)

In [18]:
bachelors[bachelors["Occupation Title"] == "Software Developers"].index

Index([228], dtype='int64')

In [20]:
bachelors.iloc[228]

index                                         348
Occupation Title              Software Developers
Total Employment                          76900.0
Job Openings in Last Month                    222
Normalized Demand                        0.004751
Typical Education Level         Bachelor's Degree
Name: 228, dtype: object

In [19]:
high_school.reset_index(inplace = True)
high_school.head()

,index,Occupation Title,Total Employment,Job Openings in Last Month,Normalized Demand,Typical Education Level
0,0,"Transportation Workers, All Other",130.0,79,1.000000,High School Diploma
1,1,"Artists and Related Workers, All Other",60.0,33,0.905063,High School Diploma
2,5,Occupational Therapy Assistants,300.0,87,0.477215,High School Diploma
3,7,Avionics Technicians,70.0,19,0.446655,High School Diploma
4,9,Statistical Assistants,30.0,8,0.438819,High School Diploma